/*
 * author: Sergey Sobolenko
 * date: 22-oct-2021
 */
#include <stdio.h>

/*
 * # 1. Загальне завдання
 * Розробка лінійних програм
 * # 2. Індивідуальне завдання
 * Номер завдання з лабораторної роботи - 20  
 * Підрахувати суму чисел у заданому діапазоні
 * # 3. Хід виконання програми
 * Знаходжу суму чисел із заданого діапазону за формулою арифметичної прогресії
 */
int main() {

    /* Задаю значения діапазона */
    int minNumber = 10;
    int maxNumber = 15;

    /* Формула суми арифметичної прогресії: S = (A1 + An) * n / 2. */
    int sum = (minNumber + maxNumber) * (maxNumber - minNumber + 1) / 2;

    return 0;
}

