/*
 * author: Sergey Sobolenko
 * date: 07-dec-2021
 */
#include <stdio.h>
#include <string.h>

/*
 * # 1. Загальне завдання
 * Розробка програм c масивами або строками
 * # 2. Індивідуальне завдання
 * Номер завдання з лабораторної роботи - 24  
 * У заданому тексті знайти кількість слів за умови, що між словами може бути будь-яка
кількість пропусків.
 * # 3. Хід виконання програми
 * У циклі завдяки умовній конструкції роблю шаблон за яким визначаю кількість слів
 */
int main() {

    /* Задаю довжину тексту*/
    #define TEXT_LEN 7
    /* Задаю значения даного тексту */
    char text[TEXT_LEN] = { ' ', 'H', ' ', 'E', 'L', 'L', 'O' };
    /* Задаю початкове значення кількості знайдених слів */
    int words_count = 0;

    /* Якщо перший сивол тексту не є пробілом, то хоча б одне слово знайдено */      
    if(text[0] != ' '){
        words_count = 1;
    }
    
    
    /* Проходжусь по кожному символу у тексті, починаючи з другого, та визначаю кількість слів */
    for(int i = 1; i < TEXT_LEN; i++){
	
        /* Шаблон виявлення слова: якщо даний символ не є пробілом, а попередній є, то маємо нове слово */
        if(text[i] != ' ' && text[i-1] == ' '){
            words_count++;
        }
    }
    
    return 0;
}


