/*
 * author: Sergey Sobolenko
 * date: 22-dec-2021
 */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

int get_words_count(char string[], int string_len);

/*
 * # 1. Загальне завдання
 * Розробка програм c масивами або строками з використанням функцій
 * # 2. Індивідуальне завдання
 * Номер завдання з лабораторної роботи - 24  
 * У заданому тексті знайти кількість слів за умови, що між словами може бути будь-яка
кількість пропусків.
 * # 3. Хід виконання програми
 * У циклі завдяки умовній конструкції роблю шаблон за яким визначаю кількість слів. Алгоритм реалізовую у функції
 */
int main() {

    srand(time(NULL));

    /* Задаю довжину тексту*/
    #define TEXT_LEN 7
    /* Задаю даний текст */
    char text[TEXT_LEN];
    
    /* Випадково заповнюю даний текст */
    for(int i = 0; i < TEXT_LEN; i++){
        
        /* Якщо число = 1, то присвоюється випадкова літера, а якщо число = 0, то пробіл */
        text[i] = rand() % 2 ? rand() % 26 +'A' : ' ';
    }
    
    /* Результуюча кількість слів */
    int result = get_words_count(text, TEXT_LEN);
    
    return 0;
}

int get_words_count(char string[], int string_len){
    
    /* Задаю початкове значення кількості знайдених слів */
    int words_count = 0;
    
    /* Якщо перший сивол тексту не є пробілом, то хоча б одне слово знайдено */ 
    if(string[0] != ' '){
        words_count = 1;
    }
    
    /* Проходжусь по кожному символу у тексті, починаючи з другого, та визначаю кількість слів */
    for(int i = 1; i < string_len; i++){
        
        /* Шаблон виявлення слова: якщо даний символ не є пробілом, а попередній є, то маємо нове слово */
        if(string[i] != ' ' && string[i-1] == ' '){
            words_count++;
        }
    }
    
    return words_count;
}


