/*
 * author: Sergey Sobolenko
 * date: 07-nov-2021
 */
#include <stdio.h>

/*
 * # 1. Загальне завдання
 * Розробка програм, що розгалужуються
 * # 2. Індивідуальне завдання
 * Номер завдання з лабораторної роботи - 23  
 * Для функції y(x) обчислити значення y в залежності від x
 * # 3. Хід виконання програми
 * Аналізуючи графік, створюю декілька умов для визначення у в залежності від х
 */
int main() {

    /* Задаю значения змінної х та оголошую у*/
    double x = 10.0;
    double y;

    /* В залежності від значення х, ініціалізую у  */
    if(x <= -1) { 
        y = -1.0 / x;
    }
    else if(x <= 1) {
        y = x * x;
    }
    else {
        y = 1;
    }

    return 0;
}
